libxmlbus/data/wsaddr-testset/documents/echo/soap11/duplicateToReplyToNone.xml

<?xml version="1.0"?>
<soap11:Envelope
    xmlns:soap11="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <soap11:Header>
    <wsa:Action>http://example.org/action/echoIn</wsa:Action>
    <wsa:MessageID>urn:uuid:BCF59302-0E0B-4EF8-B581-6F2DAFF007AF</wsa:MessageID>
    <wsa:To>http://www.w3.org/2005/08/addressing/anonymous</wsa:To>
    <wsa:To>http://www.w3.org/2005/08/addressing/anonymous</wsa:To>
    <wsa:ReplyTo>
	<wsa:Address>http://www.w3.org/2005/08/addressing/none</wsa:Address>
    </wsa:ReplyTo>
  </soap11:Header>
  <soap11:Body>
    <m:echoIn xmlns:m="http://example.org/echo">Echo This Text</m:echoIn>
  </soap11:Body>
</soap11:Envelope>

